---
type: ITransactionFinalizer
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# ITransactionFinalizer

`Autodesk.Revit.DB.ITransactionFinalizer` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | OnCommitted | 2011 | `void OnCommitted ( Document document , string strTransactionName )` |
| Method | OnRolledBack | 2011 | `void OnRolledBack ( Document document , string strTransactionName )` |